app/controllers/api_controller.rb

SELECT * FROM `servers` WHERE (apikey = '4839urif9d8yhw') LIMIT 1
UPDATE `servers` SET `updated_at` = '2011-06-19 15:28:50', `last_heartbeat` = '2011-06-19 11:28:50' WHERE `id` = 1
---
  def heartbeat
   if params[:apikey] == nil
	render :text => "FAIL {'error':{'no apikey given'}}", :status => 503 and return
   end
   @apikey=params[:apikey]
   @server=Server.find(:first, :conditions => ["apikey = ?", @apikey])
   if @apikey == nil
      render :text => "FAIL {'error':{'apikey not authorized'}}", :status => 503 and return
   else
      @server.update_attributes(:last_heartbeat => Time.now)