app/controllers/servers_controller.rb

SELECT * FROM `servers`
---
  def index
    @servers = Server.all

SELECT * FROM `servers` WHERE (`servers`.`id` = 1)
---
  def show
    @server = Server.find(params[:id])

SELECT * FROM `accounts`
---
  def new
    @server = Server.new
    @Account = Account.all

SELECT * FROM `servers` WHERE (`servers`.`id` = 1)
---
  def edit
    @server = Server.find(params[:id])

INSERT INTO `servers` (`last_heartbeat`, `created_at`, `updated_at`, `apikey`, `known_server_ip`) VALUES('06/16/2011 09:06:30', '2011-06-19 12:50:40', '2011-06-19 12:50:40', '4839urif9d8yhw', '127.0.0.1')
---
  def create
    @server = Server.new(params[:server])

    respond_to do |format|
      if @server.save

SELECT * FROM `servers` WHERE (`servers`.`id` = 1)
---
  def update
    @server = Server.find(params[:id])

SELECT * FROM `servers` WHERE (`servers`.`id` = 980190962)
DELETE FROM `servers` WHERE `id` = 980190962
---
  def destroy
    @server = Server.find(params[:id])
    @server.destroy