app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '28ae42ea4cca88876d86959470573ca0da76f3f7', '2011-06-16 16:28:09', '783a86e4193df0d7314b0b095dfcff2ae336b540', NULL, '2011-06-16 16:28:09', NULL, 'aetaric', 'aetaric@gmail.com')